import random
friends = {
    "余俊佑":{"特點":"畫很多","音量":"上課下課的時候都很吵"},
    "壺阿莉" : {"班級" : "順天書屋", "興趣" : "Python"},
    "老師":{"特點":"獅吼功","音量":"巨大"},
    "周小餅" : {"班級" : "順天書屋", "興趣" : "特戰英豪"},
    "學姊學長":{"特點":"不理我,但是都在我面前跟學長聊天","音量":"老師在好乖乖，老師不在吵死了"},
    "林小銘" : {"班級" : "順天書屋", "興趣" : "打籃球"},
    "我們班女生":{"特點":"笑點很低","音量":"大"},
    "林小庭" : {"班級" : "順天書屋", "興趣" : "看書"},
    "余豐原":{"特點":"個子很小，沒什麼力氣","音量":"上課安靜下課還好"},
    "戴阿蒂" : {"班級" : "順天書屋", "興趣" : "畫畫"},
    "張小國" : {"班級" : "順天書屋", "興趣" : "音樂"},
    "邱阿恩" : {"班級" : "順天書屋", "興趣" : "寫程式"}
}

# 直接從 items() 抽一組 (名字, 資料)
random_name, info = random.choice(list(friends.items()))

print("抽到的是：", random_name == "余俊佑" or "老師" or "學姊學長" or "我們班女生" or "余豐原")

if random_name == "余俊佑" or "老師" or "學姊學長" or "我們班女生" or "余豐原": # 邏輯錯誤 
    print("他的音量：",info["音量"])
else:
    print("他的興趣是：", info["興趣"])
